#ifndef APP_CONFIG_H_
#define APP_CONFIG_H_

//** #################################################################################################### **//
//** ========================================= 宏定义配置 ================================================ **//
//** #################################################################################################### **//

//** ================================================================================ **//
//** =============================== 宏定义各类参数 ================================== **//
//** ================================================================================ **//

//** ------------------------------------------------------------ **//
//** ======================== 电机类型 =========================== **//
//** ------------------------------------------------------------ **//

 //大疆
#define MOTOR_DJI_M3508      0     //大疆3508电机
#define MOTOR_DJI_M2006      1     //大疆2006电机
#define MOTOR_DJI_GM6020     2     //大疆6020电机
//达妙
#define MOTOR_DM_4310        3     //达妙4310电机
//张大头
#define MOTOR_ZTD_42STEP     4     //张大头42步进电机

//** ------------------------------------------------------------ **//
//** ========================== 兵种 ============================ **//
//** ------------------------------------------------------------ **//

#define ROBOTTYPE_HERO          1       //英雄机器人，1号
#define ROBOTTYPE_ENGINEER      2       //工程机器人，2号
#define ROBOTTYPE_INFANTRY      3       //步兵机器人，3号、4号
#define ROBOTTYPE_SENTRY        5       //哨兵机器人，5号
#define ROBOTTYPE_AERIAL        6       //空中机器人，6号
#define ROBOTTYPE_DART          7       //飞镖机器人，7号 

//** ------------------------------------------------------------ **//
//** ======================== 自动相关 =========================== **//
//** ------------------------------------------------------------ **//

//自动瞄准
#define AUTO_AIM_OFF              0
#define AUTO_AIM_ON               1

//自动射击
#define AUTO_SHOOTING_OFF         0
#define AUTO_SHOOTING_OFF_ON      1

//自动导航
#define AUTO_NAVIGATION_OFF       0
#define AUTO_NAVIGATION_ON        1

//** ------------------------------------------------------------ **//
//** ======================== 发射机构 =========================== **//
//** ------------------------------------------------------------ **//



//** ------------------------------------------------------------ **//
//** ========================== 底盘 ============================ **//
//** ------------------------------------------------------------ **//

// 可用底盘硬件类型
#define CHASSIS_NONE            0  // 无底盘
#define CHASSIS_MECANUM         1  // 麦克纳姆轮底盘
#define CHASSIS_OMNI            2  // 全向轮底盘
#define CHASSIS_STEERING        3  // 舵轮底盘
#define CHASSIS_LEG             4  // 平衡底盘

//** ================================================================================ **//
//** =============================== 宏定配置类参数 ================================== **//
//** ================================================================================ **//

/* 急停时间 */
#define DJI_MOTOR_STOP_TIME_MS    100 

/* 当前机器人类型,设置 */
#define ROBOT_TYPE      ROBOTTYPE_HERO

/* 控制板类型 */
#define BOARD_MODE_DUAL     0   //双板模式
#define BOARD_MODE_SINGLE   1   //单板模式

#define BOARD_MODE  BOARD_MODE_DUAL

/* 停止滤波计数 */
#define STOP_FILTER_MAXCNT  20

/* 陀螺仪类 */

//陀螺仪数组序号
#define IMU_INDEX_YAW      0
#define IMU_INDEX_PITCH    2
#define IMU_INDEX_ROLL     1

//陀螺仪极性定义
#define GYRO_NINVERT    0   // 不反转（原值）
#define GYRO_INVERT     1   // 反转（×-1）

//在这里配置每个轴的极性 
#define GYRO_YAW_POLARITY      GYRO_NINVERT   // YAW 不反转
#define GYRO_PITCH_POLARITY    GYRO_INVERT    // PITCH 反转
#define GYRO_ROLL_POLARITY     GYRO_NINVERT   // ROLL 不反转

//极性计算宏（核心公式） ======================
#define GYRO_YAW(x)       (GYRO_YAW_POLARITY    == GYRO_INVERT ? -(x) : (x))
#define GYRO_PITCH(x)     (GYRO_PITCH_POLARITY  == GYRO_INVERT ? -(x) : (x))
#define GYRO_ROLL(x)      (GYRO_ROLL_POLARITY   == GYRO_INVERT ? -(x) : (x))

/* 自瞄相关 */
#define AUTOAIM_NOPEN     0     //不编译自瞄，
#define AUTOAIM_OPEN      1     //编译自瞄
#define AUTOAIM_IFOPEN    AUTOAIM_OPEN     //是否打开自瞄系统，0不编译自瞄，1编译自瞄s

//自瞄插帧
#define AUTOAIM_SMOOTH_OFF       0

//** #################################################################################################### **//
//** ========================================= 枚举、结构体 ============================================= **//
//** #################################################################################################### **//



#endif // APP_CONFIG_H_
